详情结果/原始结果/scylla_runA.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:cassandra-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/YCSB/cassandra/conf:/home/YCSB/cassandra/target/cassandra-binding-0.15.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/io/dropwizard/metrics/metrics-core/3.1.2/metrics-core-3.1.2.jar:/root/.m2/repository/com/datastax/cassandra/cassandra-driver-core/3.0.0/cassandra-driver-core-3.0.0.jar:/root/.m2/repository/io/netty/netty-handler/4.0.33.Final/netty-handler-4.0.33.Final.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/YCSB/core/target/core-0.15.0.jar:/root/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/root/.m2/repository/io/netty/netty-transport/4.0.33.Final/netty-transport-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-codec/4.0.33.Final/netty-codec-4.0.33.Final.jar:/root/.m2/repository/com/google/guava/guava/16.0.1/guava-16.0.1.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/io/netty/netty-buffer/4.0.33.Final/netty-buffer-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-common/4.0.33.Final/netty-common-4.0.33.Final.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloada -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
Command line: -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloada -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
YCSB Client 0.15.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2018-12-28 19:11:26:290 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2018-12-28 19:11:36:261 10 sec: 176608 operations; 17659.03 current ops/sec; est completion in 9 minutes [READ: Count=88612, Max=92543, Min=1321, Avg=5660.19, 90=7539, 99=12455, 99.9=22271, 99.99=87039] [UPDATE: Count=88146, Max=86079, Min=1547, Avg=4871.78, 90=6315, 99=8487, 99.9=15391, 99.99=79743] 
2018-12-28 19:11:46:261 20 sec: 376396 operations; 19978.8 current ops/sec; est completion in 8 minutes [READ: Count=99645, Max=28031, Min=1162, Avg=5395.18, 90=7179, 99=10791, 99.9=18175, 99.99=23503] [UPDATE: Count=100069, Max=13119, Min=1499, Avg=4614.5, 90=5951, 99=7555, 99.9=9343, 99.99=11767] 
2018-12-28 19:11:56:261 30 sec: 592593 operations; 21619.7 current ops/sec; est completion in 7 minutes [READ: Count=107789, Max=32383, Min=1098, Avg=4983.72, 90=6687, 99=9935, 99.9=17087, 99.99=25263] [UPDATE: Count=108373, Max=11543, Min=1155, Avg=4265.59, 90=5519, 99=7115, 99.9=8655, 99.99=10911] 
2018-12-28 19:12:06:261 40 sec: 827442 operations; 23484.9 current ops/sec; est completion in 7 minutes [READ: Count=117577, Max=26175, Min=1123, Avg=4544.27, 90=5887, 99=8147, 99.9=13567, 99.99=17519] [UPDATE: Count=117277, Max=9831, Min=1156, Avg=3966.88, 90=4971, 99=6179, 99.9=7567, 99.99=8711] 
2018-12-28 19:12:16:261 50 sec: 1064110 operations; 23666.8 current ops/sec; est completion in 7 minutes [READ: Count=118143, Max=24511, Min=865, Avg=4514.32, 90=5815, 99=8175, 99.9=13079, 99.99=17647] [UPDATE: Count=118502, Max=8831, Min=1504, Avg=3934.55, 90=4903, 99=6071, 99.9=7267, 99.99=8559] 
2018-12-28 19:12:26:261 60 sec: 1288919 operations; 22480.9 current ops/sec; est completion in 6 minutes [READ: Count=112489, Max=22479, Min=1115, Avg=4774.61, 90=6251, 99=9031, 99.9=13951, 99.99=18431] [UPDATE: Count=112343, Max=10327, Min=1222, Avg=4117.06, 90=5211, 99=6671, 99.9=8031, 99.99=9167] 
2018-12-28 19:12:36:261 70 sec: 1525375 operations; 23645.6 current ops/sec; est completion in 6 minutes [READ: Count=118152, Max=17615, Min=1134, Avg=4511.54, 90=5791, 99=7711, 99.9=12743, 99.99=15751] [UPDATE: Count=118301, Max=9943, Min=1343, Avg=3944.43, 90=4915, 99=6067, 99.9=7459, 99.99=8455] 
2018-12-28 19:12:46:261 80 sec: 1756248 operations; 23087.3 current ops/sec; est completion in 6 minutes [READ: Count=115901, Max=22335, Min=883, Avg=4633.58, 90=5971, 99=8147, 99.9=13359, 99.99=16815] [UPDATE: Count=114969, Max=8631, Min=1466, Avg=4022.79, 90=5043, 99=6287, 99.9=7327, 99.99=8151] 
2018-12-28 19:12:56:261 90 sec: 1986383 operations; 23013.5 current ops/sec; est completion in 6 minutes [READ: Count=114969, Max=20671, Min=916, Avg=4654.79, 90=6067, 99=8383, 99.9=13383, 99.99=16799] [UPDATE: Count=115190, Max=10119, Min=986, Avg=4033.34, 90=5071, 99=6391, 99.9=7491, 99.99=8727] 
2018-12-28 19:13:06:261 100 sec: 2222836 operations; 23645.3 current ops/sec; est completion in 5 minutes [READ: Count=117791, Max=24191, Min=997, Avg=4506.48, 90=5823, 99=7947, 99.9=12703, 99.99=15511] [UPDATE: Count=118618, Max=9559, Min=1491, Avg=3951, 90=4943, 99=6143, 99.9=7255, 99.99=8095] 
2018-12-28 19:13:16:261 110 sec: 2437563 operations; 21472.7 current ops/sec; est completion in 5 minutes [READ: Count=107181, Max=26799, Min=1234, Avg=5022.52, 90=6679, 99=10071, 99.9=15271, 99.99=22767] [UPDATE: Count=107558, Max=11303, Min=1382, Avg=4289.3, 90=5495, 99=7019, 99.9=8431, 99.99=10383] 
2018-12-28 19:13:26:261 120 sec: 2630558 operations; 19299.5 current ops/sec; est completion in 5 minutes [READ: Count=96667, Max=31183, Min=1125, Avg=5682.96, 90=8067, 99=11743, 99.9=17903, 99.99=24671] [UPDATE: Count=96296, Max=12655, Min=1595, Avg=4674.91, 90=6183, 99=7991, 99.9=9647, 99.99=10623] 
2018-12-28 19:13:36:261 130 sec: 2843097 operations; 21253.9 current ops/sec; est completion in 5 minutes [READ: Count=106252, Max=30127, Min=1107, Avg=5044.74, 90=6759, 99=10135, 99.9=17615, 99.99=22239] [UPDATE: Count=106298, Max=12895, Min=1449, Avg=4362.4, 90=5671, 99=7251, 99.9=8655, 99.99=9935] 
2018-12-28 19:13:46:261 140 sec: 3075449 operations; 23235.2 current ops/sec; est completion in 5 minutes [READ: Count=116474, Max=21327, Min=916, Avg=4600.28, 90=5939, 99=8335, 99.9=13159, 99.99=16719] [UPDATE: Count=115879, Max=9855, Min=1158, Avg=4002.03, 90=4999, 99=6211, 99.9=7535, 99.99=8927] 
2018-12-28 19:13:56:261 150 sec: 3306174 operations; 23072.5 current ops/sec; est completion in 5 minutes [READ: Count=115286, Max=26063, Min=1050, Avg=4654.41, 90=6135, 99=8999, 99.9=13519, 99.99=19839] [UPDATE: Count=115436, Max=9551, Min=1253, Avg=4011.61, 90=5063, 99=6571, 99.9=7715, 99.99=8495] 
2018-12-28 19:14:06:261 160 sec: 3534666 operations; 22849.2 current ops/sec; est completion in 4 minutes [READ: Count=114029, Max=22575, Min=1094, Avg=4690.86, 90=6099, 99=8351, 99.9=13383, 99.99=17663] [UPDATE: Count=114493, Max=10263, Min=1618, Avg=4059.47, 90=5127, 99=6359, 99.9=7767, 99.99=9127] 
2018-12-28 19:14:16:261 170 sec: 3763512 operations; 22884.6 current ops/sec; est completion in 4 minutes [READ: Count=114507, Max=18863, Min=1200, Avg=4688.48, 90=6051, 99=8495, 99.9=13447, 99.99=16215] [UPDATE: Count=114330, Max=9047, Min=1407, Avg=4047.51, 90=5071, 99=6387, 99.9=7679, 99.99=8879] 
2018-12-28 19:14:26:261 180 sec: 3984462 operations; 22095 current ops/sec; est completion in 4 minutes [READ: Count=110381, Max=27487, Min=952, Avg=4889.7, 90=6391, 99=10383, 99.9=14647, 99.99=20751] [UPDATE: Count=110552, Max=13023, Min=1441, Avg=4160.29, 90=5279, 99=6935, 99.9=8719, 99.99=10823] 
2018-12-28 19:14:36:261 190 sec: 4210207 operations; 22574.5 current ops/sec; est completion in 4 minutes [READ: Count=112785, Max=30495, Min=879, Avg=4764.93, 90=6199, 99=8743, 99.9=13599, 99.99=17727] [UPDATE: Count=112970, Max=10191, Min=1472, Avg=4090.82, 90=5155, 99=6463, 99.9=7735, 99.99=9119] 
2018-12-28 19:14:46:261 200 sec: 4439888 operations; 22968.1 current ops/sec; est completion in 4 minutes [READ: Count=114881, Max=26895, Min=1114, Avg=4681.26, 90=6051, 99=8471, 99.9=13799, 99.99=18607] [UPDATE: Count=114816, Max=9903, Min=1209, Avg=4022.25, 90=5055, 99=6255, 99.9=7615, 99.99=8375] 
2018-12-28 19:14:56:261 210 sec: 4665577 operations; 22568.9 current ops/sec; est completion in 4 minutes [READ: Count=112682, Max=39487, Min=1125, Avg=4780.58, 90=6243, 99=9543, 99.9=14415, 99.99=19839] [UPDATE: Count=112985, Max=10951, Min=1558, Avg=4079.58, 90=5139, 99=6611, 99.9=8115, 99.99=9607] 
2018-12-28 19:15:06:261 220 sec: 4888116 operations; 22253.9 current ops/sec; est completion in 3 minutes [READ: Count=111160, Max=29743, Min=1252, Avg=4847.04, 90=6267, 99=8655, 99.9=14167, 99.99=18415] [UPDATE: Count=111384, Max=9439, Min=1453, Avg=4137.84, 90=5203, 99=6411, 99.9=7771, 99.99=9175] 
2018-12-28 19:15:16:261 230 sec: 5116954 operations; 22883.8 current ops/sec; est completion in 3 minutes [READ: Count=114630, Max=30095, Min=1097, Avg=4690.23, 90=6043, 99=8247, 99.9=13303, 99.99=17167] [UPDATE: Count=114206, Max=8863, Min=1278, Avg=4044.26, 90=5047, 99=6287, 99.9=7331, 99.99=8279] 
2018-12-28 19:15:26:261 240 sec: 5340495 operations; 22354.1 current ops/sec; est completion in 3 minutes [READ: Count=111905, Max=24335, Min=1108, Avg=4821.72, 90=6287, 99=8919, 99.9=14127, 99.99=18719] [UPDATE: Count=111628, Max=9727, Min=1430, Avg=4122.2, 90=5199, 99=6487, 99.9=7899, 99.99=8959] 
2018-12-28 19:15:36:261 250 sec: 5567654 operations; 22715.9 current ops/sec; est completion in 3 minutes [READ: Count=113781, Max=36415, Min=985, Avg=4734.03, 90=6095, 99=8423, 99.9=13791, 99.99=18735] [UPDATE: Count=113366, Max=8951, Min=1480, Avg=4065.13, 90=5067, 99=6315, 99.9=7387, 99.99=7947] 
2018-12-28 19:15:46:261 260 sec: 5794331 operations; 22667.7 current ops/sec; est completion in 3 minutes [READ: Count=113252, Max=26991, Min=1077, Avg=4745.03, 90=6123, 99=8487, 99.9=13783, 99.99=18239] [UPDATE: Count=113437, Max=8975, Min=1513, Avg=4075.06, 90=5095, 99=6307, 99.9=7595, 99.99=8567] 
2018-12-28 19:15:56:261 270 sec: 6014693 operations; 22036.2 current ops/sec; est completion in 2 minutes [READ: Count=110313, Max=26943, Min=969, Avg=4902.67, 90=6419, 99=9311, 99.9=14511, 99.99=19439] [UPDATE: Count=110041, Max=9759, Min=1186, Avg=4169.38, 90=5267, 99=6755, 99.9=8027, 99.99=8959] 
2018-12-28 19:16:06:261 280 sec: 6243677 operations; 22898.4 current ops/sec; est completion in 2 minutes [READ: Count=114351, Max=24463, Min=1147, Avg=4689.28, 90=6035, 99=8367, 99.9=13759, 99.99=17967] [UPDATE: Count=114629, Max=9039, Min=1548, Avg=4042.07, 90=5075, 99=6279, 99.9=7479, 99.99=8887] 
2018-12-28 19:16:16:261 290 sec: 6467822 operations; 22414.5 current ops/sec; est completion in 2 minutes [READ: Count=111856, Max=62815, Min=1068, Avg=4802.37, 90=6199, 99=8727, 99.9=14127, 99.99=41727] [UPDATE: Count=112295, Max=11143, Min=1522, Avg=4118.31, 90=5175, 99=6435, 99.9=7791, 99.99=9607] 
2018-12-28 19:16:26:261 300 sec: 6691929 operations; 22410.7 current ops/sec; est completion in 2 minutes [READ: Count=111997, Max=20927, Min=1158, Avg=4811.05, 90=6267, 99=8703, 99.9=13919, 99.99=17327] [UPDATE: Count=112118, Max=9887, Min=1408, Avg=4110.18, 90=5175, 99=6463, 99.9=7439, 99.99=8131] 
2018-12-28 19:16:36:261 310 sec: 6918111 operations; 22618.2 current ops/sec; est completion in 2 minutes [READ: Count=112878, Max=18959, Min=1011, Avg=4760.83, 90=6135, 99=8471, 99.9=13703, 99.99=16687] [UPDATE: Count=113299, Max=8503, Min=1575, Avg=4079.4, 90=5091, 99=6211, 99.9=7259, 99.99=8015] 
2018-12-28 19:16:46:261 320 sec: 7144586 operations; 22647.5 current ops/sec; est completion in 2 minutes [READ: Count=113466, Max=19007, Min=1076, Avg=4755.91, 90=6123, 99=8399, 99.9=13799, 99.99=16799] [UPDATE: Count=113000, Max=9327, Min=1495, Avg=4070.6, 90=5091, 99=6331, 99.9=7491, 99.99=8439] 
2018-12-28 19:16:56:261 330 sec: 7363702 operations; 21911.6 current ops/sec; est completion in 1 minute [READ: Count=109982, Max=22927, Min=924, Avg=4928.82, 90=6459, 99=9895, 99.9=14191, 99.99=18367] [UPDATE: Count=109158, Max=12911, Min=1166, Avg=4192.48, 90=5331, 99=6875, 99.9=8543, 99.99=11263] 
2018-12-28 19:17:06:261 340 sec: 7589267 operations; 22556.5 current ops/sec; est completion in 1 minute [READ: Count=112547, Max=20863, Min=1147, Avg=4764.19, 90=6155, 99=8631, 99.9=13719, 99.99=16911] [UPDATE: Count=113031, Max=9847, Min=1488, Avg=4099.46, 90=5135, 99=6351, 99.9=7603, 99.99=8759] 
2018-12-28 19:17:16:261 350 sec: 7813226 operations; 22395.9 current ops/sec; est completion in 1 minute [READ: Count=112170, Max=20911, Min=1132, Avg=4805.96, 90=6179, 99=8439, 99.9=13591, 99.99=16447] [UPDATE: Count=111764, Max=10287, Min=1458, Avg=4119.96, 90=5155, 99=6455, 99.9=7775, 99.99=9439] 
2018-12-28 19:17:26:261 360 sec: 8005811 operations; 19258.5 current ops/sec; est completion in 1 minute [READ: Count=96237, Max=37727, Min=1333, Avg=5732.78, 90=7907, 99=13183, 99.9=18959, 99.99=28303] [UPDATE: Count=96337, Max=15695, Min=1508, Avg=4649.66, 90=6123, 99=8695, 99.9=11071, 99.99=13071] 
2018-12-28 19:17:36:261 370 sec: 8188015 operations; 18220.4 current ops/sec; est completion in 1 minute [READ: Count=91357, Max=32239, Min=1332, Avg=6113.64, 90=8287, 99=12223, 99.9=18463, 99.99=23583] [UPDATE: Count=90855, Max=12135, Min=1861, Avg=4857.07, 90=6335, 99=8143, 99.9=9711, 99.99=10847] 
2018-12-28 19:17:46:261 380 sec: 8410735 operations; 22272 current ops/sec; est completion in 1 minute [READ: Count=111394, Max=21759, Min=799, Avg=4849.61, 90=6367, 99=8903, 99.9=13983, 99.99=17679] [UPDATE: Count=111347, Max=10183, Min=1303, Avg=4125.43, 90=5231, 99=6527, 99.9=7567, 99.99=8567] 
2018-12-28 19:17:56:261 390 sec: 8630434 operations; 21972.1 current ops/sec; est completion in 1 minute [READ: Count=109897, Max=22879, Min=986, Avg=4931.02, 90=6451, 99=9431, 99.9=14383, 99.99=18239] [UPDATE: Count=109791, Max=10167, Min=1250, Avg=4169.57, 90=5255, 99=6643, 99.9=7959, 99.99=9175] 
2018-12-28 19:18:06:261 400 sec: 8852036 operations; 22157.98 current ops/sec; est completion in 52 seconds [READ: Count=110966, Max=20831, Min=975, Avg=4864.19, 90=6303, 99=8687, 99.9=13911, 99.99=17215] [UPDATE: Count=110623, Max=9383, Min=1243, Avg=4156.44, 90=5243, 99=6495, 99.9=7707, 99.99=8647] 
2018-12-28 19:18:16:261 410 sec: 9078096 operations; 22606 current ops/sec; est completion in 42 seconds [READ: Count=112905, Max=21791, Min=815, Avg=4763.63, 90=6127, 99=8519, 99.9=13527, 99.99=16175] [UPDATE: Count=113173, Max=9623, Min=1541, Avg=4080.57, 90=5107, 99=6363, 99.9=7739, 99.99=9167] 
2018-12-28 19:18:26:261 420 sec: 9300119 operations; 22202.3 current ops/sec; est completion in 32 seconds [READ: Count=111254, Max=21887, Min=1134, Avg=4864.38, 90=6347, 99=8855, 99.9=14167, 99.99=18111] [UPDATE: Count=110745, Max=8999, Min=1232, Avg=4138.45, 90=5215, 99=6467, 99.9=7651, 99.99=8943] 
2018-12-28 19:18:36:261 430 sec: 9520379 operations; 22026 current ops/sec; est completion in 22 seconds [READ: Count=110197, Max=23231, Min=1304, Avg=4906.4, 90=6387, 99=9231, 99.9=14263, 99.99=17999] [UPDATE: Count=110076, Max=9503, Min=1562, Avg=4170.02, 90=5267, 99=6571, 99.9=7755, 99.99=8791] 
2018-12-28 19:18:46:261 440 sec: 9745217 operations; 22483.8 current ops/sec; est completion in 12 seconds [READ: Count=112446, Max=18991, Min=1070, Avg=4794.31, 90=6199, 99=8559, 99.9=13791, 99.99=16327] [UPDATE: Count=112387, Max=8903, Min=1614, Avg=4097.46, 90=5139, 99=6367, 99.9=7487, 99.99=8455] 
2018-12-28 19:18:56:261 450 sec: 9971953 operations; 22673.6 current ops/sec; est completion in 2 second [READ: Count=113263, Max=21775, Min=1260, Avg=4755.8, 90=6203, 99=9079, 99.9=13743, 99.99=17519] [UPDATE: Count=113481, Max=9687, Min=1606, Avg=4061.87, 90=5139, 99=6459, 99.9=7611, 99.99=8607] 
2018-12-28 19:18:59:974 453 sec: 10000000 operations; 7555.77 current ops/sec; [READ: Count=14007, Max=15959, Min=785, Avg=4229.82, 90=5827, 99=7887, 99.9=12919, 99.99=15599] [CLEANUP: Count=100, Max=2215935, Min=0, Avg=22150.19, 90=2, 99=13, 99.9=2215935, 99.99=2215935] [UPDATE: Count=14024, Max=8163, Min=706, Avg=3803.67, 90=4907, 99=6275, 99.9=8011, 99.99=8155] 
[OVERALL], RunTime(ms), 453712
[OVERALL], Throughput(ops/sec), 22040.413301830235
[TOTAL_GCS_PS_Scavenge], Count, 769
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1533
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3378795359170575
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 769
[TOTAL_GC_TIME], Time(ms), 1533
[TOTAL_GC_TIME_%], Time(%), 0.3378795359170575
[READ], Operations, 5000404
[READ], AverageLatency(us), 4852.9857299530195
[READ], MinLatency(us), 785
[READ], MaxLatency(us), 92543
[READ], 95thPercentileLatency(us), 7055
[READ], 99thPercentileLatency(us), 9647
[READ], Return=OK, 5000404
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 22150.19
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2215935
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 13
[UPDATE], Operations, 4999596
[UPDATE], AverageLatency(us), 4152.230070189671
[UPDATE], MinLatency(us), 706
[UPDATE], MaxLatency(us), 86079
[UPDATE], 95thPercentileLatency(us), 5727
[UPDATE], 99thPercentileLatency(us), 6795
[UPDATE], Return=OK, 4999596